smrtkrft/SynDimm/Code/neue/sdkconfig.defaults
# SynDimm neue — BF sdkconfig.defaults'tan türetildi (bkz. plan T0.1).
# Fark: partition tablosu SynDimm'inki; cihaz sabit güçte ama PM/tickless
# bedava tasarruf olduğu için korunuyor.
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Custom partition table — A/B OTA, 64KB NVS, SPIFFS yok.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# USB Serial/JTAG: boot log + sk_transport_usb CLI.
# (BF'deki USB_SERIAL_JTAG_ENABLED ve ESP_CONSOLE_HISTORY_BUFFER_SIZE
#  sembolleri IDF 5.5.2'de yok — kconfig uyarısı verdikleri için alınmadı.)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# sk_ota rollback koruması.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# === Task Watchdog (uzun-çalışma stabilitesi P0) =====================
# 7/24 çalışma için: bir task hang/deadlock olursa TWDT reset ATSIN (uyarı
# değil) → ESP_RST_TASK_WDT → recovery-boot sayacı artar → self-heal.
# sd_cmd ve sd_input task'ları esp_task_wdt_add ile abone + her turda besler.
# INIT/EN/TIMEOUT IDF varsayılanı (5 sn); yalnız PANIC'i açıyoruz.
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
CONFIG_ESP_TASK_WDT_PANIC=y

# Bluetooth — NimBLE host (sk_transport_ble).
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
# Curve25519 + ECDH çağrıları default 4096'da stack overflow yapıyor (BF'de
# saha bulgusu: "Stack protection fault" nimble_host'ta). 8192 rahat alan.
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=8192

# Default event loop stack — WiFi olayları event-bus abonelerine fan-out
# ederken 2304 yetmiyor (BF saha bulgusu, Nis 2026). 6 KB.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=6144

# TLS sertifika paketi — sk_api HTTPS webhook'ları için (Let's Encrypt vb.).
# Boyut kapısı aşılırsa budama merdiveni: FULL → CMN (plan: Boyut Kapıları).
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# NVS şifreleme dev kartlarda kapalı; üretimde açılacak.
CONFIG_NVS_ENCRYPTION=n

# -Os: boyut optimizasyonu, assertion'lar açık kalır.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_BOOTLOADER_LOG_LEVEL=2

# === Güç yönetimi ====================================================
# Sabit güçte bile DFS + tickless idle bedava kazanç; USB takılıyken IDF
# driver'ı kendi NO_LIGHT_SLEEP kilidini tutuyor (USJ_NO_AUTO_LS), yani
# geliştirme deneyimi etkilenmez.
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_IDLE_TIME_BEFORE_SLEEP=3
CONFIG_BT_LE_SLEEP_ENABLE=y
CONFIG_BT_LE_LP_CLK_SRC_MAIN_XTAL=y
# BLE light-sleep + tickless idle, C6'da MAC/baseband power-down ister
# (bt.c:867 #error: SOC_PM_RETENTION_HAS_CLOCK_BUG && !CONFIG_MAC_BB_PD).
CONFIG_ESP_PHY_MAC_BB_PD=y
CONFIG_USJ_NO_AUTO_LS_ON_CONNECTION=y
